In [4]:
import pandas as pd

In [5]:
dat = pd.read_csv("predictions.csv")

In [6]:
dat

                      team   rating   rank
0                  Houston   10.990    4.0
1                     Duke    7.792    1.0
2                   Auburn   11.178    5.0
3                  Florida    8.512    2.0
4                  Alabama   24.482   10.0
..                     ...      ...    ...
359             Chicago St  127.808  227.0
360            The Citadel  128.000  307.0
361    Arkansas Pine Bluff  121.856  145.0
362              Coppin St  128.000  307.0
363  Mississippi Valley St  127.488  198.0

[364 rows x 3 columns]

In [77]:
t1 = 'duke'
t2 = 'flor'

dat[(dat['team'].str.lower().str.contains(t1.lower()))
    |
    (dat['team'].str.lower().str.contains(t2.lower()))].sort_values(by='rating',ascending=True)

                   team   rating   rank
1                  Duke    7.792    1.0
3               Florida    8.512    2.0
328          Florida AM  121.088  141.0
163  Florida Gulf Coast  125.984  176.0
110    Florida Atlantic  126.600  181.0
256       North Florida  127.680  211.0
86           Florida St  128.000  307.0
190       South Florida  128.000  307.0